using System;
using System.Collections.Generic;
using System.Text;

namespace Tool
{
    public class CLConfig
    {
        /// <summary>
        /// 过滤
        /// </summary>
        public static string[] filterStr = new string[] {
            "千歳","佐久間里依","Rie Sakuma"
        };

        /// <summary>
        /// 识别
        /// </summary>
        public static string[] has = new string[] {
            "みやび真央","雅真央","池田径","ももかりん","阿久美々","阿久美美","あくみみ","Aku Mimi","爱杏美","あずみ恋","愛乃なみ","爱乃娜美","爱沢花","爱沢かりん","安城安娜","安城アンナ","AnnaAnjyo","安藤なつみ","杏堂夏","白咲碧","しろさき あおい","香椎みなみ","Kashii Minami","百合川さら","Arisu Chigasaki","Arisu Chigasaki","柏倉玲華","柏仓玲华","かしわくられいか","Reika Kashiwakura","坂下奈穂","一ノ瀬丽花","いちのせれいか","一ノ瀬麗花","Reika Ichinose","保坂えり","ほさかえり","保坂绘里","Hosaka Eri","坂野恵理"," Sakano Eri","三浦つかさ","北川美雪","高瀬杏","北島玲","きたじま れい","本多なるみ","本多成实","朝比奈舞","あさひなまい","菅原すみれ","asahinamai","赤坂瑠衣","赤井美月","あかいみつき","Akai Mitsuki","川村まや","川村真矢","Kawamura Maya","大城かえで","吉沢咲良","おおしろかえで","Oshiro Kaede","大岛喜代叶","ひめかわきよは"," Himekawa Kiyoha","大槻ひびき","大槻响","おおつき ひびき","大空美緒","大空美绪","おおぞらみお","若桜りく","月野美羽","白石華","河合優衣","斎藤彩","oozoramio","大橋未久","おおはしみく","渡辺美羽","わたなべみう","楓ゆうか","枫优香","Yuuka Kaede","逢沢はるか","黒木琴音","福山さやか","福山沙耶香","Sayaka1","高城ゆい","高城结衣","折笠忍","折笠しのぶ","Sayaka Takashiro","Shinobu Orikasa","高城由衣","宮崎由麻","津田由加里","Yukari Miyazaki","みやざきゆま","宮崎由麻","古瀬玲","古瀬リカ","雏森あゆみ","古田奈央","Hinamori Ayumi","香月兰","和泉紫乃","いずみしの","Izumi Shino","河西あみ","来栖千夏","杏あづさ","杏あずさ","るすちなつ","Kurushu Chinatsu","横山みれい","横山美玲","よこやまみれい","藤池れみ",
            "藤田紀美子","花井メイサ","花井美沙","はない めいさ","Hanai Meisa","荒木りな","荒木里菜","Rina Araki","佳苗るか","佳苗瑠华","かなえるか","Ruka Kanae",
            "菅野亜梨沙","かんの ありさ","Kanno Arisa","菅野亚梨沙","Arisa Kanno","橘ひなた","橘日向","Hinata Tachibana","君野紗枝","君野纱枝","葵Yume","葵梦","葵ゆめ","あおいゆめ","aoiyume","瀬奈まお","瀨奈真绪","せな まお","Mao Sena","立川理惠","立川理恵","たちかわりえ","立花さや","立花沙耶","立花美涼","雪乃ほたる","Yukino Hotaru","雪乃萤","綾瀬なるみ","绫濑成美","Narumi Ayase","绫瀬なるみ","麻倉憂","麻倉憂が","麻生芽依","麻生めい","佐藤美希","あそうめい","Aso Mei","美月るな","美月琉奈","美月優芽","みづきゆめ","アダルト","みづきゆめ","美月优芽","Mizuki Yume","美智子小夜曲","夢実あくび","木村美羽","きむらみう","Kimura Miu","木下寧々","木下宁宁","Nene Kinoshita","きのしたねね","牧村ひな","牧村雏","南菜菜","南菜々","まきむらひな","Makimura Hina","池内七海","池田夏海","いけだなつみ","Natsumi Ikeda","前田かおり","前田香织","Maeda Kaori","Maeda Kaori","前田由美","桥本优希","井上遥香","井上遥香","牧野宏美","Maeda Yumi","まえだゆみ","茜梨乃","あかねりの","Akane Rino","藤川麻美","长谷川ゆな","西浦あかね","あかねりの","清水理紗","しみずりさ","清水理纱","Risa Shimizu","秋元まゆ花","爱花沙也","Saya Aika","あきもとまゆか","日向優梨","日向优梨","Yuuri Hinata","ひゅうがゆうり","Hyuga Yuri","若槻ゆうか",
            "若槻优香","Yuuka Wakatsuki","若槻優香","沙藤ユリ","沙藤百合","川上由比香","satou yuri","くるみ","久留美","仙堂なるみ","沙藤みき","山手栞","上條めぐ","三浦芽依","上原保奈美","うえはらほなみ","Honami Uehara","上原亜衣","上原亚衣","うえはら あい丶","あいちん","神崎玲香","神尾舞","柚原綾","柚原绫","Aya Yuzuhara","石川しずか","石川静香","石川施恩惠","石川めぐみ","绀野りさ子","石原あみ","石原亚美","いしはらあみ","Ishihara Ami","水城奈緒","水城奈绪",":みずきなお","The Mizuki","水野葵","みずのあおい","Aoi Mizuno","水沢えみり","水島美沙","みずしまみさ","Mizushima Misa","水沢真樹","柏木爱","maki mizusaw","水泽真树","さとうりお","松本芽依","松本メイ","松永わかな","松永若菜","桐乃みく","桐乃未来","Kirino Mikuni","きりのみくに","舞咲み","舞咲美娜","舞咲みくに","舞咲美都","Maisaki Mikuni","西川りおん","西川里音","西山希","にしやま のぞみ","西条沙羅","さいじょうさら","西条沙罗","Sara Saijo","小峰日向","小峰ひなた","Komine Hinata","小日向みく","小日向美久","Miku Kohinata","小西友梨","こにしゆり","Konishi Yuri","小野麻里亜","小野麻里亚","Maria Ono","小桜りく","小樱莉久"," こざくらり","小沢アリス","小泽爱丽丝","ALICE OZAWA","小泽艾莉丝","Ozawa Arisu","篠めぐみ","筱惠美","川越ゆい","川越唯","篠崎ジュリア","筱崎茱莉亚","Shinozaki Jyuria","しのざきじゅりあ","篠田あゆみ","篠田步美","しのだあゆみ","新山かえで","新山枫","Niiyama Kaede","星崎アソリ","星崎安里","星崎Anri","星咲優菜","ほしざきゆうな","絢森いちか","绚森莓","Ichika Ayamori","葉山友香","叶山友香","はやまともか","一ノ瀬アメリ","濑亚美莉","栗栖エリカ","美空あやか","翼みさき","翼美咲","つばさみさき","Misaki Tsubasa","櫻井ともか","樱井知香","Tomoka Sakurai","櫻木梨乃","樱木梨乃","叶月めぐ","Rino Sakuragi","葉月めぐ","さくらぎりの","羽鳥みか","西f本さくら","佐藤美香","羽鸟美香","羽田未来","七瀬 ゆい","羽田未來","中川志穂","雨宮琴音","遠藤あいこ","远藤爱子","Aiko Endo","源みいな","源美衣奈","Minamoto Miina","泽井芽衣",
            "长泽梓","长泽あずさ","ながさわ あずさ","Nagazawa Azusa","真咲惠美","真咲恵美",
            "佐伯ゆきな","佐伯雪菜","冲ひとみ","冲瞳","Oki Hitomi","高山玲奈","柄本ゆかり","柄本由里香","Yukari Emoto","julia","京香","朝桐光","南野灯","冲田杏梨","岛崎丽那","花城步","花城あゆ","臼井里美","臼井さと美","Usui Satomi","美月","Mizuki","Mizuki、みづき","茜梨乃","あかねりの","Akane Rino","藤川麻美","长谷川ゆな","西浦あかね","仁科百华","にしな ももか","杉崎絵里奈","杉崎絵里奈","すぎさきえりな","Sugisaki Erina","梢あをな","梢青奈","市来美保","奥菜アンナ","姫野ゆうり","仲间あずみ","霧島さくら","雾岛樱","Sakura Kirishima","西条琉璃","西條るり","希咲あや","希咲彩","きさきあや","筱崎爱","叶みわ","永井美纪","原紗央莉","原沙央莉","织田真子","織田真子","宫崎由麻",

        };
    }
}
